#### Terraform Plan Status: success

<details><summary>Show Plan</summary>

```
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Reading...
aws_cloudwatch_event_rule.weekly_ml_predictions: Refreshing state... [id=nba-cap-development-weekly-ml-predictions]
aws_cloudwatch_event_rule.monthly_ml_training: Refreshing state... [id=nba-cap-development-monthly-ml-training]
aws_iam_role.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn]
aws_iam_role.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn]
aws_cloudwatch_event_rule.weekly_etl: Refreshing state... [id=nba-cap-development-weekly-etl]
aws_iam_role.bastion: Refreshing state... [id=nba-cap-development-bastion-role]
aws_iam_role.sagemaker_execution: Refreshing state... [id=nba-cap-development-sagemaker-execution]
aws_iam_role.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml]
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Read complete after 0s [id=683313688378]
data.aws_ami.amazon_linux_2023: Reading...
aws_s3_bucket.frontend: Refreshing state... [id=nba-cap-frontend-development]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/nba-cap-development-predictions-api]
aws_s3_bucket.data: Refreshing state... [id=nba-cap-development-data]
aws_secretsmanager_secret.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1]
aws_api_gateway_rest_api.predictions_api: Refreshing state... [id=i08r86q01i]
aws_iam_role.lambda_execution: Refreshing state... [id=nba-cap-development-lambda-execution]
aws_iam_role.step_functions: Refreshing state... [id=nba-cap-development-step-functions]
aws_cloudwatch_event_rule.monthly_etl: Refreshing state... [id=nba-cap-development-monthly-etl]
aws_vpc.main: Refreshing state... [id=vpc-0b6c5f3947a364991]
aws_cloudfront_origin_access_identity.frontend: Refreshing state... [id=E2QKUUQXGKQ2NW]
aws_iam_instance_profile.bastion: Refreshing state... [id=nba-cap-development-bastion-profile]
aws_iam_role_policy_attachment.bastion_ssm: Refreshing state... [id=nba-cap-development-bastion-role-20260223231501912800000001]
aws_iam_role_policy_attachment.sagemaker_full_access: Refreshing state... [id=nba-cap-development-sagemaker-execution-20260226055128501200000001]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549032400000003]
aws_iam_role_policy.step_functions_lambda: Refreshing state... [id=nba-cap-development-step-functions:nba-cap-development-step-functions-lambda]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549022400000002]
aws_api_gateway_resource.teams: Refreshing state... [id=yl2ys4]
aws_api_gateway_resource.predictions: Refreshing state... [id=pf6a9y]
aws_api_gateway_resource.metadata: Refreshing state... [id=8fosh2]
aws_api_gateway_resource.teams_detail: Refreshing state... [id=e38ice]
module.cors_teams.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-yl2ys4-OPTIONS]
aws_api_gateway_method.teams_get: Refreshing state... [id=agm-i08r86q01i-yl2ys4-GET]
aws_api_gateway_resource.predictions_player: Refreshing state... [id=udgxfw]
aws_api_gateway_resource.predictions_undervalued: Refreshing state... [id=kdbtn7]
data.aws_ami.amazon_linux_2023: Read complete after 0s [id=ami-0ee72650e64503637]
aws_api_gateway_method.predictions_get: Refreshing state... [id=agm-i08r86q01i-pf6a9y-GET]
aws_api_gateway_resource.predictions_overvalued: Refreshing state... [id=8djqun]
module.cors_predictions.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-pf6a9y-OPTIONS]
aws_s3_bucket_website_configuration.frontend: Refreshing state... [id=nba-cap-frontend-development]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=nba-cap-frontend-development]
aws_api_gateway_method.metadata_get: Refreshing state... [id=agm-i08r86q01i-8fosh2-GET]
aws_s3_bucket_policy.frontend: Refreshing state... [id=nba-cap-frontend-development]
aws_api_gateway_method.teams_detail_get: Refreshing state... [id=agm-i08r86q01i-e38ice-GET]
aws_cloudfront_distribution.frontend: Refreshing state... [id=E19QA2V7TXG7IA]
module.cors_teams.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-yl2ys4-OPTIONS]
module.cors_teams.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-yl2ys4-OPTIONS-200]
module.cors_metadata.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-8fosh2-OPTIONS]
aws_api_gateway_method.predictions_player_get: Refreshing state... [id=agm-i08r86q01i-udgxfw-GET]
aws_api_gateway_method.predictions_undervalued_get: Refreshing state... [id=agm-i08r86q01i-kdbtn7-GET]
module.cors_teams_detail.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-e38ice-OPTIONS]
module.cors_predictions.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-pf6a9y-OPTIONS]
module.cors_predictions.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-pf6a9y-OPTIONS-200]
aws_s3_bucket_versioning.data: Refreshing state... [id=nba-cap-development-data]
aws_lambda_function.validate_data: Refreshing state... [id=nba-cap-development-validate-data]
aws_iam_role_policy.lambda_s3_rds: Refreshing state... [id=nba-cap-development-lambda-execution:nba-cap-development-lambda-s3-rds]
aws_lambda_function.copy_trained_model: Refreshing state... [id=nba-cap-development-copy-trained-model]
aws_iam_role_policy.sagemaker_custom: Refreshing state... [id=nba-cap-development-sagemaker-execution:nba-cap-development-sagemaker-custom]
aws_lambda_function.transform_data: Refreshing state... [id=nba-cap-development-transform-data]
aws_s3_object.feature_engineering_code: Refreshing state... [id=ml/code/feature_engineering.py]
aws_s3_object.schema_sql: Refreshing state... [id=db/schema.sql]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=nba-cap-development-data]
aws_lambda_function.fetch_data: Refreshing state... [id=nba-cap-development-fetch-data]
aws_s3_object.migration_files["001_add_etl_run_tracking.sql"]: Refreshing state... [id=db/migrations/001_add_etl_run_tracking.sql]
aws_s3_object.migration_files["002_add_prediction_run_tracking.sql"]: Refreshing state... [id=db/migrations/002_add_prediction_run_tracking.sql]
aws_s3_object.salary_cap_static_data: Refreshing state... [id=static/salary_cap_history.json]
aws_api_gateway_method.predictions_overvalued_get: Refreshing state... [id=agm-i08r86q01i-8djqun-GET]
module.cors_predictions_player.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-udgxfw-OPTIONS]
module.cors_predictions_undervalued.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-kdbtn7-OPTIONS]
module.cors_metadata.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-8fosh2-OPTIONS-200]
module.cors_metadata.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-8fosh2-OPTIONS]
module.cors_teams.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-yl2ys4-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-e38ice-OPTIONS]
module.cors_teams_detail.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-e38ice-OPTIONS-200]
module.cors_predictions.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-pf6a9y-OPTIONS-200]
module.cors_predictions_overvalued.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-8djqun-OPTIONS]
module.cors_predictions_player.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-udgxfw-OPTIONS-200]
module.cors_predictions_player.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-udgxfw-OPTIONS]
module.cors_predictions_undervalued.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-kdbtn7-OPTIONS]
module.cors_predictions_undervalued.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-kdbtn7-OPTIONS-200]
module.cors_metadata.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-8fosh2-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-e38ice-OPTIONS-200]
module.cors_predictions_overvalued.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-8djqun-OPTIONS-200]
module.cors_predictions_overvalued.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-8djqun-OPTIONS]
module.cors_predictions_undervalued.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-kdbtn7-OPTIONS-200]
module.cors_predictions_player.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-udgxfw-OPTIONS-200]
module.cors_predictions_overvalued.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-8djqun-OPTIONS-200]
aws_internet_gateway.main: Refreshing state... [id=igw-0043d0b7878bef291]
aws_subnet.private_b: Refreshing state... [id=subnet-066bb8a4e7c4c5f71]
aws_subnet.public: Refreshing state... [id=subnet-0f1c3b45289fc2f33]
aws_route_table.private: Refreshing state... [id=rtb-029dd305c3f4ac761]
aws_subnet.private_a: Refreshing state... [id=subnet-024001c7e70b8e723]
aws_security_group.vpc_endpoints: Refreshing state... [id=sg-01985e1e8d1a5b899]
aws_security_group.bastion: Refreshing state... [id=sg-044703878f38eaf04]
aws_security_group.rds: Refreshing state... [id=sg-0d332cdd9de9f1ea8]
aws_security_group.lambda: Refreshing state... [id=sg-0d348276a26bc3621]
aws_route_table.public: Refreshing state... [id=rtb-0f2bcd46b702b9ee0]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-026914add1fbd9388]
aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2890896799]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-08fac94fecdbb4de3]
aws_instance.bastion: Refreshing state... [id=i-0f6603a98461ad9cb]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-07f35ad4111286f9d]
aws_db_subnet_group.main: Refreshing state... [id=nba-cap-development-db-subnet]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-047e599a9347baa95]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-086f25003cd7ad678]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0cc2835137bdb4431]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-01aeb7d4c2f914500]
aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-06d1351c58050b1bc]
aws_lambda_function.migrate_schema: Refreshing state... [id=nba-cap-development-migrate-schema]
aws_db_instance.main: Refreshing state... [id=db-EKSITIKQZJTCIAMKGGFH4JIJCQ]
null_resource.trigger_schema_migration: Refreshing state... [id=2716770943834433870]
aws_secretsmanager_secret_version.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001]
aws_cloudwatch_metric_alarm.rds_cpu: Refreshing state... [id=nba-cap-development-rds-high-cpu]
aws_lambda_function.extract_prediction_data: Refreshing state... [id=nba-cap-development-extract-prediction-data]
aws_lambda_function.api_handler: Refreshing state... [id=nba-cap-development-api-handler]
aws_lambda_function.load_predictions: Refreshing state... [id=nba-cap-development-load-predictions]
aws_lambda_function.load_to_rds: Refreshing state... [id=nba-cap-development-load-to-rds]
aws_lambda_function.extract_training_data: Refreshing state... [id=nba-cap-development-extract-training-data]
aws_api_gateway_integration.teams_get: Refreshing state... [id=agi-i08r86q01i-yl2ys4-GET]
aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.teams_detail_get: Refreshing state... [id=agi-i08r86q01i-e38ice-GET]
aws_api_gateway_integration.predictions_undervalued_get: Refreshing state... [id=agi-i08r86q01i-kdbtn7-GET]
aws_api_gateway_integration.predictions_overvalued_get: Refreshing state... [id=agi-i08r86q01i-8djqun-GET]
aws_api_gateway_integration.predictions_player_get: Refreshing state... [id=agi-i08r86q01i-udgxfw-GET]
aws_api_gateway_integration.metadata_get: Refreshing state... [id=agi-i08r86q01i-8fosh2-GET]
aws_api_gateway_integration.predictions_get: Refreshing state... [id=agi-i08r86q01i-pf6a9y-GET]
aws_sfn_state_machine.etl_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-etl-pipeline]
aws_sfn_state_machine.ml_predictions_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-predictions-pipeline]
aws_iam_role_policy.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn:nba-cap-development-ml-pipeline-sfn-policy]
aws_sfn_state_machine.ml_training_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-training-pipeline]
aws_iam_role_policy.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn:nba-cap-development-eventbridge-sfn-policy]
aws_cloudwatch_event_target.monthly_etl_pipeline: Refreshing state... [id=nba-cap-development-monthly-etl-MonthlyETLStateMachine]
aws_cloudwatch_event_target.weekly_etl_pipeline: Refreshing state... [id=nba-cap-development-weekly-etl-WeeklyETLStateMachine]
aws_cloudwatch_metric_alarm.etl_failures: Refreshing state... [id=nba-cap-development-etl-failures]
aws_cloudwatch_event_target.monthly_training_target: Refreshing state... [id=nba-cap-development-monthly-ml-training-MonthlyMLTrainingPipeline]
aws_iam_role_policy.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml:nba-cap-development-eventbridge-sfn-policy]
aws_cloudwatch_event_target.weekly_predictions_target: Refreshing state... [id=nba-cap-development-weekly-ml-predictions-WeeklyMLPredictionsPipeline]
aws_api_gateway_deployment.predictions_api: Refreshing state... [id=oi0ao1]
aws_api_gateway_stage.v1: Refreshing state... [id=ags-i08r86q01i-v1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.main will be updated in-place
  ~ resource "aws_db_instance" "main" {
        id                                    = "db-EKSITIKQZJTCIAMKGGFH4JIJCQ"
      - password                              = (sensitive value) -> null
        tags                                  = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (55 unchanged attributes hidden)
    }

  # aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ ami                                  = "ami-0aae19d30bab785d3" -> "ami-0ee72650e64503637" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:840033527097:instance/i-0f6603a98461ad9cb" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0f6603a98461ad9cb" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05ffb5114bae49d14" -> (known after apply)
      ~ private_dns                          = "ip-10-0-10-217.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.10.217" -> (known after apply)
      ~ public_dns                           = "ec2-44-203-12-146.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.203.12.146" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "development"
            "Name"        = "nba-cap-development-bastion"
            "Project"     = "nba-cap"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {
              - "Environment" = "development"
              - "ManagedBy"   = "terraform"
              - "Project"     = "nba-cap-optimizer"
            } -> null
          - tags_all              = {
              - "Environment" = "development"
              - "ManagedBy"   = "terraform"
              - "Project"     = "nba-cap-optimizer"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-068e15f8e6e92e7dc" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_secretsmanager_secret_version.db_credentials must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db_credentials" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260218013731188500000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.rds will be updated in-place
  ~ resource "aws_security_group" "rds" {
        id                     = "sg-0d332cdd9de9f1ea8"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "PostgreSQL from bastion host"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-044703878f38eaf04",
                ]
              - self             = false
              - to_port          = 5432
            },
            # (1 unchanged element hidden)
        ]
        name                   = "nba-cap-development-rds-sg"
        tags                   = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.ml_predictions_pipeline will be updated in-place
  ~ resource "aws_sfn_state_machine" "ml_predictions_pipeline" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ BatchTransform        = {
                      ~ Parameters     = {
                          ~ "ModelName.$"        = "States.Format('salary-predictor-{}', $.execution_id)" -> "States.Format('salary-pred-{}', $.job_id)"
                          ~ "TransformJobName.$" = "States.Format('predict-{}', $.execution_id)" -> "States.Format('predict-{}', $.job_id)"
                            # (3 unchanged attributes hidden)
                        }
                        # (7 unchanged attributes hidden)
                    }
                  ~ CreateModel           = {
                      ~ Parameters     = {
                          ~ "ModelName.$"    = "States.Format('salary-predictor-{}', $.execution_id)" -> "States.Format('salary-pred-{}', $.job_id)"
                            # (2 unchanged attributes hidden)
                        }
                        # (6 unchanged attributes hidden)
                    }
                  ~ FeatureEngineering    = {
                      ~ Parameters     = {
                          ~ "ProcessingJobName.$"  = "States.Format('feature-eng-predict-{}', $.execution_id)" -> "States.Format('feat-eng-pred-{}', $.job_id)"
                            # (7 unchanged attributes hidden)
                        }
                        # (6 unchanged attributes hidden)
                    }
                  ~ GenerateExecutionId   = {
                      ~ Parameters = {
                          + "job_id.$"       = "States.UUID()"
                            # (2 unchanged attributes hidden)
                        }
                      + ResultPath = "$"
                        # (2 unchanged attributes hidden)
                    }
                    # (4 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-predictions-pipeline"
        name          = "nba-cap-development-ml-predictions-pipeline"
        tags          = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.ml_training_pipeline will be updated in-place
  ~ resource "aws_sfn_state_machine" "ml_training_pipeline" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ FeatureEngineering      = {
                      ~ Parameters     = {
                          ~ "ProcessingJobName.$"  = "States.Format('feature-eng-{}', $.execution_id)" -> "States.Format('feat-eng-train-{}', $.job_id)"
                            # (7 unchanged attributes hidden)
                        }
                        # (6 unchanged attributes hidden)
                    }
                  ~ GenerateExecutionId     = {
                      ~ Parameters = {
                          + "job_id.$"       = "States.UUID()"
                            # (2 unchanged attributes hidden)
                        }
                      + ResultPath = "$"
                        # (2 unchanged attributes hidden)
                    }
                  ~ ModelTraining           = {
                      ~ Parameters     = {
                          ~ "TrainingJobName.$"    = "States.Format('train-{}', $.execution_id)" -> "States.Format('train-{}', $.job_id)"
                            # (7 unchanged attributes hidden)
                        }
                        # (6 unchanged attributes hidden)
                    }
                    # (4 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-training-pipeline"
        name          = "nba-cap-development-ml-training-pipeline"
        tags          = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

Changes to Outputs:
  ~ bastion_instance_id      = "i-0f6603a98461ad9cb" -> (known after apply)
  ~ bastion_public_ip        = "44.203.12.146" -> (known after apply)
  ~ ssm_port_forward_command = "aws ssm start-session --target i-0f6603a98461ad9cb --document-name AWS-StartPortForwardingSessionToRemoteHost --parameters '{"host":["nba-cap-development-db.cmhskaacuhfp.us-east-1.rds.amazonaws.com"],"portNumber":["5432"],"localPortNumber":["5432"]}' --profile personal-account" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Workspace:** dev
**Environment:** development
